""" When add new list of choices don't forget to import it to './local_settings.py' """

""" Areas available choices """
AREA_0 = "0"
AREA_1 = "1"
AREA_2 = "2"
AREA_3 = "3"
AREA_4 = "4"
AREA_5 = "5"
AREA_6 = "6"
AREA_7 = "7"
AREA_8 = "8"
AREA_9 = "9"
AREA_10 = "10"
AREA_11 = "11"
AREA_12 = "12"
AREA_13 = "13"
AREA_14 = "14"
AREA_15 = "15"
AREA_16 = "16"
AREA_17 = "17"
AREA_18 = "18"
AREA_19 = "19"
AREA_20 = "20"
AREA_21 = "21"
AREA_22 = "22"
AREA_23 = "23"
AREA_24 = "24"
AREA_25 = "25"
AREA_26 = "26"
AREA_27 = "27"
AREA_28 = "28"
AREA_29 = "29"
AREA_30 = "30"
AREA_31 = "31"
AREA_32 = "32"
AREA_33 = "33"
AREA_34 = "34"
AREA_35 = "35"
AREA_36 = "36"
AREA_37 = "37"
AREA_38 = "38"
AREA_39 = "39"
AREA_40 = "40"
AREA_41 = "41"
AREA_42 = "42"
AREA_43 = "43"
AREA_44 = "44"
AREA_45 = "45"
AREA_46 = "46"
AREA_47 = "47"
AREA_48 = "48"
AREA_49 = "49"
AREA_50 = "50"
AREA_51 = "51"
AREA_52 = "52"
AREA_53 = "53"
AREA_54 = "54"
AREA_55 = "55"
AREA_56 = "56"
AREA_57 = "57"
AREA_58 = "58"
AREA_59 = "59"
AREA_60 = "60"
AREA_61 = "61"
AREA_62 = "62"
AREA_63 = "63"
AREA_64 = "64"
AREA_65 = "65"
AREA_66 = "66"
AREA_67 = "67"
AREA_68 = "68"
AREA_69 = "69"
AREA_70 = "70"
AREA_71 = "71"
AREA_72 = "72"
AREA_73 = "73"
AREA_74 = "74"
AREA_75 = "75"
AREA_76 = "76"
AREA_77 = "77"
AREA_78 = "78"
AREA_79 = "79"
AREA_80 = "80"
AREA_81 = "81"
AREA_82 = "82"
AREA_83 = "83"
AREA_84 = "84"
AREA_85 = "85"
AREA_86 = "86"
AREA_87 = "87"
AREA_88 = "88"
AREA_89 = "89"
AREA_90 = "90"
AREA_91 = "91"
AREA_92 = "92"
AREA_93 = "93"
AREA_94 = "94"
AREA_95 = "95"
AREA_96 = "96"
AREA_97 = "97"
AREA_98 = "98"
AREA_99 = "99"
AREA_100 = "100"
AREA_101 = "101"
AREA_102 = "102"
AREA_103 = "103"
AREA_104 = "104"
AREA_105 = "105"
AREA_106 = "106"
AREA_107 = "107"
AREA_108 = "108"
AREA_109 = "109"
AREA_110 = "110"
AREA_111 = "111"
AREA_112 = "112"
AREA_113 = "113"
AREA_114 = "114"
AREA_115 = "115"
AREA_116 = "116"
AREA_117 = "117"
AREA_118 = "118"
AREA_119 = "119"
AREA_120 = "120"
AREA_121 = "121"
AREA_122 = "122"
AREA_123 = "123"
AREA_124 = "124"
AREA_125 = "125"
AREA_126 = "126"
AREA_127 = "127"
AREA_128 = "128"
AREA_129 = "129"
AREA_130 = "130"
AREA_131 = "131"
AREA_132 = "132"
AREA_133 = "133"
AREA_134 = "134"
AREA_135 = "135"
AREA_136 = "136"
AREA_137 = "137"
AREA_138 = "138"
AREA_139 = "139"
AREA_140 = "140"
AREA_141 = "141"
AREA_142 = "142"
AREA_143 = "143"
AREA_144 = "144"
AREA_145 = "145"
AREA_146 = "146"
AREA_147 = "147"
AREA_148 = "148"
AREA_149 = "149"
AREA_150 = "150"
AREA_151 = "151"
AREA_152 = "152"
AREA_153 = "153"
AREA_154 = "154"
AREA_155 = "155"
AREA_156 = "156"
AREA_157 = "157"
AREA_158 = "158"
AREA_159 = "159"
AREA_160 = "160"
AREA_161 = "161"
AREA_162 = "162"
AREA_163 = "163"
AREA_164 = "164"
AREA_165 = "165"
AREA_166 = "166"
AREA_167 = "167"
AREA_168 = "168"
AREA_169 = "169"
AREA_170 = "170"
AREA_171 = "171"
AREA_172 = "172"
AREA_173 = "173"
AREA_174 = "174"
AREA_175 = "175"
AREA_176 = "176"
AREA_177 = "177"
AREA_178 = "178"
AREA_179 = "179"
AREA_180 = "180"
AREA_181 = "181"
AREA_182 = "182"
AREA_183 = "183"
AREA_184 = "184"
AREA_185 = "185"
AREA_186 = "186"
AREA_187 = "187"
AREA_188 = "188"
AREA_189 = "189"
AREA_190 = "190"
AREA_191 = "191"
AREA_192 = "192"
AREA_193 = "193"
AREA_194 = "194"
AREA_195 = "195"
AREA_196 = "196"
AREA_197 = "197"
AREA_198 = "198"
AREA_199 = "199"
AREA_200 = "200"
AREA_201 = "201"
AREA_202 = "202"
AREA_203 = "203"
AREA_204 = "204"
AREA_205 = "205"
AREA_206 = "206"
AREA_207 = "207"
AREA_208 = "208"
AREA_209 = "209"
AREA_210 = "210"
AREA_211 = "211"
AREA_212 = "212"
AREA_213 = "213"
AREA_214 = "214"
AREA_215 = "215"
AREA_216 = "216"
AREA_217 = "217"

AREAS = [
    (AREA_0, "Район Панчарево"),
    (AREA_1, "Район Овча купел"),
    (AREA_2, "Район Нови Искър"),
    (AREA_3, "Район Надежда"),
    (AREA_4, "Район Люлин"),
    (AREA_5, "Район Кремиковци"),
    (AREA_6, "Район Искър"),
    (AREA_7, "Район Връбница"),
    (AREA_8, "Район Витоша"),
    (AREA_9, "Район Банкя"),
    (AREA_10, "Южен парк"),
    (AREA_11, "Северен парк"),
    (AREA_12, "Резиденция Бояна"),
    (AREA_13, "Парк Централни софийски гробища"),
    (AREA_14, "Парк Малашевски гробища"),
    (AREA_15, "Парк Западен парк"),
    (AREA_16, "Парк Заимов"),
    (AREA_17, "Парк Гео Милев"),
    (AREA_18, "Парк Въртопо"),
    (AREA_19, "Парк Ботаническа градина"),
    (AREA_20, "Парк Борисова градина"),
    (AREA_21, "Парк Бакърени гробища"),
    (AREA_22, "Ловен парк"),
    (AREA_23, "Източен парк"),
    (AREA_24, "Зоопарк"),
    (AREA_25, "с. Яна"),
    (AREA_26, "с. Чепинци"),
    (AREA_27, "с. Световрачене"),
    (AREA_28, "с. Подгумер"),
    (AREA_29, "с. Плана"),
    (AREA_30, "с. Панчарево"),
    (AREA_31, "с. Негован"),
    (AREA_32, "с. Мърчаево"),
    (AREA_33, "с. Мрамор"),
    (AREA_34, "с. Мировяне"),
    (AREA_35, "с. Мало Бучино"),
    (AREA_36, "с. Локорско"),
    (AREA_37, "с. Лозен"),
    (AREA_38, "с. Кътина"),
    (AREA_39, "с. Кубратово"),
    (AREA_40, "с. Кривина"),
    (AREA_41, "с. Кокаляне"),
    (AREA_42, "с. Клисура"),
    (AREA_43, "с. Казичене"),
    (AREA_44, "с. Иваняне"),
    (AREA_45, "с. Житен"),
    (AREA_46, "с. Желява"),
    (AREA_47, "с. Железница"),
    (AREA_48, "с. Долни Пасарел"),
    (AREA_49, "с. Долни Богров"),
    (AREA_50, "с. Доброславци"),
    (AREA_51, "с. Горни Богров"),
    (AREA_52, "с. Герман"),
    (AREA_53, "с. Волуяк"),
    (AREA_54, "с. Войнеговци"),
    (AREA_55, "с. Владая"),
    (AREA_56, "с. Бусманци"),
    (AREA_57, "с. Бистрица"),
    (AREA_58, "с. Балша"),
    (AREA_59, "м-т яз. Искър"),
    (AREA_60, "м-т Яладжа"),
    (AREA_61, "м-т Юбилейна гора"),
    (AREA_62, "м-т Щъркелово гнездо"),
    (AREA_63, "м-т Подлозище"),
    (AREA_64, "м-т Мала кория"),
    (AREA_65, "м-т Киноцентъра"),
    (AREA_66, "м-т Камбаните"),
    (AREA_67, "м-т Детски град"),
    (AREA_68, "м-т Гърдова глава"),
    (AREA_69, "м-т Батареята"),
    (AREA_70, "м-т Барите"),
    (AREA_71, "ж.гр.Южен парк"),
    (AREA_72, "ж.гр.Зоопарк"),
    (AREA_73, "гр. Нови Искър"),
    (AREA_74, "гр. Бухово"),
    (AREA_75, "гр. Банкя"),
    (AREA_76, "в.з.Черния кос"),
    (AREA_77, "в.з.Симеоново - Драгалевци"),
    (AREA_78, "в.з.Малинова долина - Герена"),
    (AREA_79, "в.з.Малинова долина"),
    (AREA_80, "в.з.Люлин"),
    (AREA_81, "в.з.Киноцентъра 3 част"),
    (AREA_82, "в.з.Киноцентъра"),
    (AREA_83, "в.з.Килиите"),
    (AREA_84, "в.з.Горна баня"),
    (AREA_85, "в.з.Врана - Лозен"),
    (AREA_86, "в.з.Врана - Герман"),
    (AREA_87, "в.з.Бункера"),
    (AREA_88, "в.з.Бояна"),
    (AREA_89, "в.з.Беловодски път"),
    (AREA_90, "в.з.Американски колеж"),
    (AREA_91, "Яворов"),
    (AREA_92, "Челопечене"),
    (AREA_93, "Център"),
    (AREA_94, "Христо Ботев"),
    (AREA_95, "Хладилника"),
    (AREA_96, "Хиподрума"),
    (AREA_97, "Хаджи Димитър"),
    (AREA_98, "Фондови жилища"),
    (AREA_99, "Филиповци"),
    (AREA_100, "Факултета"),
    (AREA_101, "Триъгълника"),
    (AREA_102, "Требич"),
    (AREA_103, "Толстой"),
    (AREA_104, "Суходол"),
    (AREA_105, "Сухата река"),
    (AREA_106, "Студентски град"),
    (AREA_107, "Стрелбище"),
    (AREA_108, "Слатина"),
    (AREA_109, "Славия"),
    (AREA_110, "Симеоново"),
    (AREA_111, "Сеславци"),
    (AREA_112, "Сердика"),
    (AREA_113, "Свобода"),
    (AREA_114, "Света Троица"),
    (AREA_115, "СПЗ Слатина"),
    (AREA_116, "СПЗ Модерно предградие"),
    (AREA_117, "Република 2"),
    (AREA_118, "Република"),
    (AREA_119, "Редута"),
    (AREA_120, "Разсадника"),
    (AREA_121, "Полигона"),
    (AREA_122, "Подуяне"),
    (AREA_123, "Павлово"),
    (AREA_124, "ПЗ Хладилника"),
    (AREA_125, "ПЗ Илиянци"),
    (AREA_126, "Орландовци"),
    (AREA_127, "Овча купел 2"),
    (AREA_128, "Овча купел 1"),
    (AREA_129, "Овча купел"),
    (AREA_130, "Оборище"),
    (AREA_131, "Обеля 2"),
    (AREA_132, "Обеля 1"),
    (AREA_133, "Обеля"),
    (AREA_134, "Надежда 4"),
    (AREA_135, "Надежда 3"),
    (AREA_136, "Надежда 2"),
    (AREA_137, "Надежда 1"),
    (AREA_138, "НПЗ Хаджи Димитър"),
    (AREA_139, "НПЗ Средец"),
    (AREA_140, "НПЗ Искър"),
    (AREA_141, "НПЗ Изток"),
    (AREA_142, "Мусагеница"),
    (AREA_143, "Модерно предградие"),
    (AREA_144, "Младост 4"),
    (AREA_145, "Младост 3"),
    (AREA_146, "Младост 2"),
    (AREA_147, "Младост 1А"),
    (AREA_148, "Младост 1"),
    (AREA_149, "Медицинска академия"),
    (AREA_150, "Манастирски ливади"),
    (AREA_151, "Малинова долина"),
    (AREA_152, "Малашевци"),
    (AREA_153, "Люлин 9"),
    (AREA_154, "Люлин 8"),
    (AREA_155, "Люлин 7"),
    (AREA_156, "Люлин 6"),
    (AREA_157, "Люлин 5"),
    (AREA_158, "Люлин 4"),
    (AREA_159, "Люлин 3"),
    (AREA_160, "Люлин 2"),
    (AREA_161, "Люлин 10"),
    (AREA_162, "Люлин 1"),
    (AREA_163, "Люлин - център"),
    (AREA_164, "Лозенец"),
    (AREA_165, "Летище София"),
    (AREA_166, "Левски Г"),
    (AREA_167, "Левски В"),
    (AREA_168, "Левски"),
    (AREA_169, "Лагера"),
    (AREA_170, "Кръстова вада"),
    (AREA_171, "Кремиковци"),
    (AREA_172, "Красно село"),
    (AREA_173, "Красна поляна 3"),
    (AREA_174, "Красна поляна 2"),
    (AREA_175, "Красна поляна 1"),
    (AREA_176, "Княжево"),
    (AREA_177, "Карпузица"),
    (AREA_178, "Илиянци"),
    (AREA_179, "Илинден"),
    (AREA_180, "Изток"),
    (AREA_181, "Изгрев"),
    (AREA_182, "Иван Вазов"),
    (AREA_183, "Зона Б-5-3"),
    (AREA_184, "Зона Б-5"),
    (AREA_185, "Зона Б-19"),
    (AREA_186, "Зона Б-18"),
    (AREA_187, "Захарна фабрика"),
    (AREA_188, "Западен парк"),
    (AREA_189, "Експериментален"),
    (AREA_190, "Дървеница"),
    (AREA_191, "Дружба 2"),
    (AREA_192, "Дружба 1"),
    (AREA_193, "Драгалевци"),
    (AREA_194, "Докторски паметник"),
    (AREA_195, "Димитър Миленков"),
    (AREA_196, "Дианабад"),
    (AREA_197, "Гоце Делчев"),
    (AREA_198, "Горубляне"),
    (AREA_199, "Горна баня"),
    (AREA_200, "Гео Милев"),
    (AREA_201, "Гевгелийски"),
    (AREA_202, "Връбница 2"),
    (AREA_203, "Връбница 1"),
    (AREA_204, "Враждебна"),
    (AREA_205, "Военна рампа"),
    (AREA_206, "Витоша"),
    (AREA_207, "Градина"),
    (AREA_208, "Бъкстон"),
    (AREA_209, "Бояна"),
    (AREA_210, "Ботунец 2"),
    (AREA_211, "Ботунец"),
    (AREA_212, "Борово"),
    (AREA_213, "Бенковски"),
    (AREA_214, "Белите брези"),
    (AREA_215, "Банишора"),
    (AREA_216, "Абдовица"),
    (AREA_217, "7-ми 11-ти километър")
]

""" hours available choices """
TWELVE_AM = "00"
ОNЕ_AM = "01"
TWO_AM = "02"
THREE_AM = "03"
FOUR_AM = "04"
FIVE_AM = "05"
SIX_AM = "06"
SEVEN_AM = "07"
EIGHT_AM = "08"
NINE_AM = "09"
TEN_AM = "10"
ELEVEN_AM = "11"
TWELVE_PM = "12"
ОНЕ_PM = "13"
TWO_PM = "14"
THREE_PM = "15"
FOUR_PM = "16"
FIVE_PM = "17"
SIX_PM = "18"
SEVEN_PM = "19"
EIGHT_PM = "20"
NINE_PM = "21"
TEN_PM = "22"
ELEVEN_PM = "23"

HOURS = [
    (TWELVE_AM, "TWELVE AM"),
    (ОNЕ_AM, "ОNЕ AM"),
    (TWO_AM, "TWO AM"),
    (THREE_AM, "THREE AM"),
    (FOUR_AM, "FOUR AM"),
    (FIVE_AM, "FIVE AM"),
    (SIX_AM, "SIX AM"),
    (SEVEN_AM, "SEVEN AM"),
    (EIGHT_AM, "EIGHT AM"),
    (NINE_AM, "NINE AM"),
    (TEN_AM, "TEN AM"),
    (ELEVEN_AM, "ELEVEN AM"),
    (TWELVE_PM, "TWELVE PM"),
    (ОНЕ_PM, "ОНЕ PM"),
    (TWO_PM, "TWO PM"),
    (THREE_PM, "THREE PM"),
    (FOUR_PM, "FOUR PM"),
    (FIVE_PM, "FIVE PM"),
    (SIX_PM, "SIX PM"),
    (SEVEN_PM, "SEVEN PM"),
    (EIGHT_PM, "EIGHT PM"),
    (NINE_PM, "NINE PM"),
    (TEN_PM, "TEN PM"),
    (ELEVEN_PM, "ELEVEN PM")
    ]

""" screen event available choices """
VIEWER = "viewer"
REACHED = "reached"
HOLDER = "holder"
BTN_USER = "btn_usr"

EVENTS = [
    (VIEWER, "Viewer"),
    (REACHED, "Reached"),
    (HOLDER, "Holder"),
    (BTN_USER, "Button user")
]
